PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc17xx/lpc17_ethernet.h
/* Register addresses ***************************************************************/
/* MAC registers */

#define LPC17_ETH_MAC1              (LPC17_ETH_BASE+LPC17_ETH_MAC1_OFFSET)
#define LPC17_ETH_MAC2              (LPC17_ETH_BASE+LPC17_ETH_MAC2_OFFSET)
#define LPC17_ETH_IPGT              (LPC17_ETH_BASE+LPC17_ETH_IPGT_OFFSET)
#define LPC17_ETH_IPGR              (LPC17_ETH_BASE+LPC17_ETH_IPGR_OFFSET)
#define LPC17_ETH_CLRT              (LPC17_ETH_BASE+LPC17_ETH_CLRT_OFFSET)
#define LPC17_ETH_MAXF              (LPC17_ETH_BASE+LPC17_ETH_MAXF_OFFSET)
#define LPC17_ETH_SUPP              (LPC17_ETH_BASE+LPC17_ETH_SUPP_OFFSET)
#define LPC17_ETH_TEST              (LPC17_ETH_BASE+LPC17_ETH_TEST_OFFSET)
#define LPC17_ETH_MCFG              (LPC17_ETH_BASE+LPC17_ETH_MCFG_OFFSET)
#define LPC17_ETH_MCMD              (LPC17_ETH_BASE+LPC17_ETH_MCMD_OFFSET)
#define LPC17_ETH_MADR              (LPC17_ETH_BASE+LPC17_ETH_MADR_OFFSET)
#define LPC17_ETH_MWTD              (LPC17_ETH_BASE+LPC17_ETH_MWTD_OFFSET)
#define LPC17_ETH_MRDD              (LPC17_ETH_BASE+LPC17_ETH_MRDD_OFFSET)
#define LPC17_ETH_MIND              (LPC17_ETH_BASE+LPC17_ETH_MIND_OFFSET)
#define LPC17_ETH_SA0               (LPC17_ETH_BASE+LPC17_ETH_SA0_OFFSET)
#define LPC17_ETH_SA1               (LPC17_ETH_BASE+LPC17_ETH_SA1_OFFSET)
#define LPC17_ETH_SA2               (LPC17_ETH_BASE+LPC17_ETH_SA2_OFFSET)

/* Control registers */

#define LPC17_ETH_CMD               (LPC17_ETH_BASE+LPC17_ETH_CMD_OFFSET)
#define LPC17_ETH_STAT              (LPC17_ETH_BASE+LPC17_ETH_STAT_OFFSET)
#define LPC17_ETH_RXDESC            (LPC17_ETH_BASE+LPC17_ETH_RXDESC_OFFSET)
#define LPC17_ETH_RXSTAT            (LPC17_ETH_BASE+LPC17_ETH_RXSTAT_OFFSET)
#define LPC17_ETH_RXDESCNO          (LPC17_ETH_BASE+LPC17_ETH_RXDESCNO_OFFSET)
#define LPC17_ETH_RXPRODIDX         (LPC17_ETH_BASE+LPC17_ETH_RXPRODIDX_OFFSET)
#define LPC17_ETH_RXCONSIDX         (LPC17_ETH_BASE+LPC17_ETH_RXCONSIDX_OFFSET)
#define LPC17_ETH_TXDESC            (LPC17_ETH_BASE+LPC17_ETH_TXDESC_OFFSET)
#define LPC17_ETH_TXSTAT            (LPC17_ETH_BASE+LPC17_ETH_TXSTAT_OFFSET)
#define LPC17_ETH_TXDESCRNO         (LPC17_ETH_BASE+LPC17_ETH_TXDESCRNO_OFFSET)
#define LPC17_ETH_TXPRODIDX         (LPC17_ETH_BASE+LPC17_ETH_TXPRODIDX_OFFSET)
#define LPC17_ETH_TXCONSIDX         (LPC17_ETH_BASE+LPC17_ETH_TXCONSIDX_OFFSET)
#define LPC17_ETH_TSV0              (LPC17_ETH_BASE+LPC17_ETH_TSV0_OFFSET)
#define LPC17_ETH_TSV1              (LPC17_ETH_BASE+LPC17_ETH_TSV1_OFFSET)
#define LPC17_ETH_RSV               (LPC17_ETH_BASE+LPC17_ETH_RSV_OFFSET)
#define LPC17_ETH_FCCNTR            (LPC17_ETH_BASE+LPC17_ETH_FCCNTR_OFFSET)
#define LPC17_ETH_FCSTAT            (LPC17_ETH_BASE+LPC17_ETH_FCSTAT_OFFSET)

/* Rx filter registers */

#define LPC17_ETH_RXFLCTRL          (LPC17_ETH_BASE+LPC17_ETH_RXFLCTRL_OFFSET)
#define LPC17_ETH_RXFLWOLST         (LPC17_ETH_BASE+LPC17_ETH_RXFLWOLST_OFFSET)
#define LPC17_ETH_RXFLWOLCLR        (LPC17_ETH_BASE+LPC17_ETH_RXFLWOLCLR_OFFSET)
#define LPC17_ETH_HASHFLL           (LPC17_ETH_BASE+LPC17_ETH_HASHFLL_OFFSET)
#define LPC17_ETH_HASHFLH           (LPC17_ETH_BASE+LPC17_ETH_HASHFLH_OFFSET)

/* Module control registers */

#define LPC17_ETH_INTST             (LPC17_ETH_BASE+LPC17_ETH_INTST_OFFSET)
#define LPC17_ETH_INTEN             (LPC17_ETH_BASE+LPC17_ETH_INTEN_OFFSET)
#define LPC17_ETH_INTCLR            (LPC17_ETH_BASE+LPC17_ETH_INTCLR_OFFSET)
#define LPC17_ETH_INTSET            (LPC17_ETH_BASE+LPC17_ETH_INTSET_OFFSET)
#define LPC17_ETH_PWRDOWN           (LPC17_ETH_BASE+LPC17_ETH_PWRDOWN_OFFSET)

/* Register bit definitions *********************************************************/
/* MAC registers */
/* MAC configuration register 1 (MAC1) */

#define ETH_MAC1_RE                 (1 << 0)  /* Bit 0:  Receive enable */
#define ETH_MAC1_PARF               (1 << 1)  /* Bit 1:  Passall all receive frames */
#define ETH_MAC1_RFC                (1 << 2)  /* Bit 2:  RX flow control */
#define ETH_MAC1_TFC                (1 << 3)  /* Bit 3:  TX flow control */
#define ETH_MAC1_LPBK               (1 << 4)  /* Bit 4:  Loopback */
                                              /* Bits 5-7: Reserved */
#define ETH_MAC1_TXRST              (1 << 8)  /* Bit 8:  Reset TX */
#define ETH_MAC1_MCSTXRST           (1 << 9)  /* Bit 9:  Reset MCS/TX */
#define ETH_MAC1_RXRST              (1 << 10) /* Bit 10: Reset RX */
#define ETH_MAC1_MCSRXRST           (1 << 11) /* Bit 11: Reset MCS/RX */
                                              /* Bits 12-13: Reserved */
#define ETH_MAC1_SIMRST             (1 << 14) /* Bit 14: Simulation reset */
#define ETH_MAC1_SOFTRST            (1 << 15) /* Bit 15: Soft reset */
                                              /* Bits 16-31: Reserved */
/* MAC configuration register 2 (MAC2) */

#define ETH_MAC2_FD                 (1 << 0)  /* Bit 0:  Full duplex */
#define ETH_MAC2_FLC                (1 << 1)  /* Bit 1:  Frame length checking */
#define ETH_MAC2_HFE                (1 << 2)  /* Bit 2:  Huge frame enable */
#define ETH_MAC2_DCRC               (1 << 3)  /* Bit 3:  Delayed CRC */
#define ETH_MAC2_CRCEN              (1 << 4)  /* Bit 4:  CRC enable */
#define ETH_MAC2_PADCRCEN           (1 << 5)  /* Bit 5:  Pad/CRC enable */
#define ETH_MAC2_VLANPADEN          (1 << 6)  /* Bit 6:  VLAN pad enable */
#define ETH_MAC2_AUTOPADEN          (1 << 7)  /* Bit 7:  Auto detect pad enable */
#define ETH_MAC2_PPE                (1 << 8)  /* Bit 8:  Pure preamble enforcement */
#define ETH_MAC2_LPE                (1 << 9)  /* Bit 9:  Long preamble enforcement */
                                              /* Bits 10-11: Reserved */
#define ETH_MAC2_NBKOFF             (1 << 12) /* Bit 12: No backoff */
#define ETH_MAC2_BPNBKOFF           (1 << 13) /* Bit 13: Back pressure/no backoff */
#define ETH_MAC2_EXDEF              (1 << 14) /* Bit 14: Excess defer */
                                              /* Bits 15-31: Reserved */
/* Back-to-Back Inter-Packet-Gap register (IPGT) */

#define ETH_IPGT_SHIFT              (0)       /* Bits 0-6 */
#define ETH_IPGT_MASK               (0x7f << ETH_IPGT_SHIFT)
                                              /* Bits 7-31: Reserved */
/* Non Back-to-Back Inter-Packet-Gap register (IPGR) */

#define ETH_IPGR_GAP2_SHIFT         (0)       /* Bits 0-6: Gap part 2 */
#define ETH_IPGR_GAP2_MASK          (0x7f << ETH_IPGR_GAP2_SHIFT)
                                              /* Bit 7: Reserved */
#define ETH_IPGR_GAP1_SHIFT         (8)       /* Bits 8-18: Gap part 1 */
#define ETH_IPGR_GAP1_MASK          (0x7f << ETH_IPGR_GAP2_SHIFT)
                                              /* Bits 15-31: Reserved */
/* Collision window / Retry register (CLRT) */

