PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc17xx/lpc17_ethernet.h
#define ETH_CLRT_RMAX_SHIFT         (0)       /* Bits 0-3: Retransmission maximum */
#define ETH_CLRT_RMAX_MASK          (15 << ETH_CLRT_RMAX_SHIFT)
                                              /* Bits 4-7: Reserved */
#define ETH_CLRT_COLWIN_SHIFT       (8)       /* Bits 8-13: Collision window */
#define ETH_CLRT_COLWIN_MASK        (0x3f << ETH_CLRT_COLWIN_SHIFT)
                                              /* Bits 14-31: Reserved */
/* Maximum Frame register (MAXF) */

#define ETH_MAXF_SHIFT              (0)       /* Bits 0-15 */
#define ETH_MAXF_MASK               (0xffff << ETH_MAXF_SHIFT)
                                              /* Bits 16-31: Reserved */
/* PHY Support register (SUPP) */
                                              /* Bits 0-7: Reserved */
#define ETH_SUPP_SPEED              (1 << 8)  /* Bit 8:  0=10Bps 1=100Bps */
                                              /* Bits 9-31: Reserved */
/* Test register (TEST) */

#define ETH_TEST_SPQ                (1 << 0)  /* Bit 0:  Shortcut pause quanta */
#define ETH_TEST_TP                 (1 << 1)  /* Bit 1:  Test pause */
#define ETH_TEST_TBP                (1 << 2)  /* Bit 2:  Test packpressure */
                                              /* Bits 3-31: Reserved */
/* MII Mgmt Configuration register (MCFG) */

#define ETH_MCFG_SCANINC            (1 << 0)  /* Bit 0:  Scan increment */
#define ETH_MCFG_SUPPRE             (1 << 1)  /* Bit 1:  Suppress preamble */
#define ETH_MCFG_CLKSEL_SHIFT       (2)       /* Bits 2-5: Clock select */
#define ETH_MCFG_CLKSEL_MASK        (15 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV4      (0 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV6      (2 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV8      (3 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV10     (4 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV14     (5 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV20     (6 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV28     (7 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV36     (8 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV40     (9 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV44     (10 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV48     (11 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV52     (12 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV56     (13 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV60     (14 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV64     (15 << ETH_MCFG_CLKSEL_SHIFT)
                                              /* Bits 6-14: Reserved */
#define ETH_MCFG_MIIRST             (1 << 15) /* Bit 15: Reset MII mgmt */
                                              /* Bits 16-31: Reserved */
/* MII Mgmt Command register (MCMD) */

#define ETH_MCMD_READ               (1 << 0)  /* Bit 0:  Single read cycle */
#define ETH_MCMD_SCAN               (1 << 1)  /* Bit 1:  Continuous read cycles */
                                              /* Bits 2-31: Reserved */
#define ETH_MCMD_WRITE              (0)

/* MII Mgmt Address register (MADR) */

#define ETH_MADR_REGADDR_SHIFT      (0)       /* Bits 0-4: Register address */
#define ETH_MADR_REGADDR_MASK       (31 << ETH_MADR_REGADDR_SHIFT)
                                              /* Bits 7-5: Reserved */
#define ETH_MADR_PHYADDR_SHIFT      (8)       /* Bits 8-12: PHY address */
#define ETH_MADR_PHYADDR_MASK       (31 << ETH_MADR_PHYADDR_SHIFT)
                                              /* Bits 13-31: Reserved */
/* MII Mgmt Write Data register (MWTD) */

#define ETH_MWTD_SHIFT              (0)       /* Bits 0-15 */
#define ETH_MWTD_MASK               (0xffff << ETH_MWTD_SHIFT)
                                              /* Bits 16-31: Reserved */
/* MII Mgmt Read Data register (MRDD) */

#define ETH_MRDD_SHIFT              (0)       /* Bits 0-15 */
#define ETH_MRDD_MASK               (0xffff << ETH_MRDD_SHIFT)
                                              /* Bits 16-31: Reserved */
/* MII Mgmt Indicators register (MIND) */

#define ETH_MIND_BUSY               (1 << 0)  /* Bit 0:  Busy */
#define ETH_MIND_SCANNING           (1 << 1)  /* Bit 1:  Scanning */
#define ETH_MIND_NVALID             (1 << 2)  /* Bit 2:  Not valid */
#define ETH_MIND_MIIFAIL            (1 << 3)  /* Bit 3:  MII link fail */
                                              /* Bits 4-31: Reserved */
/* Station Address 0 register (SA0) */

#define ETH_SA0_OCTET2_SHIFT        (0)       /* Bits 0-7: Station address 2nd octet */
#define ETH_SA0_OCTET2_MASK         (0xff << ETH_SA0_OCTET2_SHIFT)
#define ETH_SA0_OCTET1_SHIFT        (8)       /* Bits 8-15: Station address 1st octet */
#define ETH_SA0_OCTET1_MASK         (0xff << ETH_SA0_OCTET1_SHIFT)
                                              /* Bits 16-31: Reserved */
/* Station Address 1 register (SA1) */

#define ETH_SA1_OCTET4_SHIFT        (0)       /* Bits 0-7: Station address 4th octet */
#define ETH_SA1_OCTET4_MASK         (0xff << ETH_SA0_OCTET4_SHIFT)
#define ETH_SA1_OCTET3_SHIFT        (8)       /* Bits 8-15: Station address 3rd octet */
#define ETH_SA1_OCTET3_MASK         (0xff << ETH_SA0_OCTET3_SHIFT)
                                              /* Bits 16-31: Reserved */
/* Station Address 2 register (SA2) */

#define ETH_SA2_OCTET6_SHIFT        (0)       /* Bits 0-7: Station address 5th octet */
#define ETH_SA2_OCTET6_MASK         (0xff << ETH_SA0_OCTET6_SHIFT)
#define ETH_SA2_OCTET5_SHIFT        (8)       /* Bits 8-15: Station address 6th octet */
#define ETH_SA2_OCTET5_MASK         (0xff << ETH_SA0_OCTET5_SHIFT)
                                              /* Bits 16-31: Reserved */
/* Control registers */
/* Command register (CMD) */

#define ETH_CMD_RXEN                (1 << 0)  /* Bit 0:  Receive enable */
#define ETH_CMD_TXEN                (1 << 1)  /* Bit 1:  Transmit enable */
                                              /* Bit 2:  Reserved */
#define ETH_CMD_REGRST              (1 << 3)  /* Bit 3:  Reset host registers */
#define ETH_CMD_TXRST               (1 << 4)  /* Bit 4:  Reset transmit datapath */
#define ETH_CMD_RXRST               (1 << 5)  /* Bit 5:  Reset receive datapath */
#define ETH_CMD_PRFRAME             (1 << 6)  /* Bit 6:  Pass run frame */
#define ETH_CMD_PRFILTER            (1 << 7)  /* Bit 7:  Pass RX filter */
#define ETH_CMD_TXFC                (1 << 8)  /* Bit 8:  TX flow control */
#define ETH_CMD_RMII                (1 << 9)  /* Bit 9:  RMII mode */
#define ETH_CMD_FD                  (1 << 10) /* Bit 10: Full duplex */
                                              /* Bits 11-31: Reserved */
/* Status register */

