PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc17xx/lpc17_ethernet.h
#define ETH_STAT_RX                 (1 << 0)  /* Bit 0:  RX status */
#define ETH_STAT_TX                 (1 << 1)  /* Bit 1:  TX status */
                                              /* Bits 2-31: Reserved */
/* Receive descriptor base address register (RXDESC)
 *
 * The receive descriptor base address is a byte address aligned to a word
 * boundary i.e. LSB 1:0 are fixed to 00. The register contains the lowest
 * address in the array of descriptors.
 */

/* Receive status base address register (RXSTAT)
 *
 * The receive status base address is a byte address aligned to a double word
 * boundary i.e. LSB 2:0 are fixed to 000.
 */

/* Receive number of descriptors register (RXDESCNO) */

#define ETH_RXDESCNO_SHIFT          (0)       /* Bits 0-15 */
#define ETH_RXDESCNO_MASK           (0xffff << ETH_RXDESCNO_SHIFT)
                                              /* Bits 16-31: Reserved */
/* Receive produce index register (RXPRODIDX) */

#define ETH_RXPRODIDX_SHIFT         (0)       /* Bits 0-15 */
#define ETH_RXPRODIDX_MASK          (0xffff << ETH_RXPRODIDX_SHIFT)
                                              /* Bits 16-31: Reserved */
/* Receive consume index register (RXCONSIDX) */

#define ETH_RXCONSIDX_SHIFT         (0)       /* Bits 0-15 */
#define ETH_RXCONSIDX_MASK          (0xffff << ETH_RXPRODIDX_SHIFT)
                                              /* Bits 16-31: Reserved */
/* Transmit descriptor base address register (TXDESC)
 *
 *  The transmit descriptor base address is a byte address aligned to a word
 *  boundary i.e. LSB 1:0 are fixed to 00. The register contains the lowest
 * address in the array of descriptors.
 */

/* Transmit status base address register (TXSTAT)
 *
 * The transmit status base address is a byte address aligned to a word
 * boundary i.e. LSB1:0 are fixed to 00. The register contains the lowest
 * address in the array of statuses.
 */

/* Transmit number of descriptors register (TXDESCRNO) */

#define ETH_TXDESCRNO_SHIFT         (0)       /* Bits 0-15 */
#define ETH_TXDESCRNO_MASK          (0xffff << ETH_TXDESCRNO_SHIFT)
                                              /* Bits 16-31: Reserved */
/* Transmit produce index register (TXPRODIDX) */

#define ETH_TXPRODIDX_SHIFT         (0)       /* Bits 0-15 */
#define ETH_TXPRODIDX_MASK          (0xffff << ETH_TXPRODIDX_SHIFT)
                                              /* Bits 16-31: Reserved */
/* Transmit consume index register (TXCONSIDX) */

#define ETH_TXCONSIDX_SHIFT         (0)       /* Bits 0-15 */
#define ETH_TXCONSIDX_MASK          (0xffff << ETH_TXPRODIDX_SHIFT)
                                              /* Bits 16-31: Reserved */
/* Transmit status vector 0 register (TSV0) */

#define ETH_TSV0_CRCERR             (1 << 0)  /* Bit 0:  CRC error */
#define ETH_TSV0_LENCHKERR          (1 << 1)  /* Bit 1:  Length check error */
#define ETH_TSV0_LENOOR             (1 << 2)  /* Bit 2:  Length out of range */
#define ETH_TSV0_DONE               (1 << 3)  /* Bit 3:  Done */
#define ETH_TSV0_MCAST              (1 << 4)  /* Bit 4:  Multicast */
#define ETH_TSV0_BCAST              (1 << 5)  /* Bit 5:  Broadcast */
#define ETH_TSV0_PKTDEFER           (1 << 6)  /* Bit 6:  Packet Defer */
#define ETH_TSV0_EXCDEFER           (1 << 7)  /* Bit 7:  Excessive Defer */
#define ETH_TSV0_EXCCOL             (1 << 8)  /* Bit 8:  Excessive Collision */
#define ETH_TSV0_LATECOL            (1 << 9)  /* Bit 9:  Late Collision */
#define ETH_TSV0_GIANT              (1 << 10) /* Bit 10: Giant */
#define ETH_TSV0_UNDRUN             (1 << 11) /* Bit 11: Underrun */
#define ETH_TSV0_TOTBYTES_SHIFT     (12)      /* Bits 12-27:Total bytes */
#define ETH_TSV0_TOTBYTES_MASK      (0xffff << ETH_TSV0_TOTBYTES_SHIFT)
#define ETH_TSV0_CTLFRAME           (1 << 28) /* Bit 28: Control frame */
#define ETH_TSV0_PAUSE              (1 << 29) /* Bit 29: Pause */
#define ETH_TSV0_BP                 (1 << 30) /* Bit 30: Backpressure */
#define ETH_TSV0_VLAN               (1 << 31) /* Bit 31: VLAN */

/* Transmit status vector 1 register (TSV1) */

#define ETH_TSV1_TXCNT_SHIFT        (0)       /* Bits 0-15: Transmit byte count */
#define ETH_TSV1_TXCNT_MASK         (0xffff << ETH_TSV1_TXCNT_SHIFT)
#define ETH_TSV1_COLCNT_SHIFT       (16)      /* Bits 16-19: Transmit collision count */
#define ETH_TSV1_COLCNT_MASK        (15 << ETH_TSV1_COLCNT_SHIFT)
                                              /* Bits 20-31: Reserved */
/* Receive status vector register (RSV) */

#define ETH_RSV_RXCNT_SHIFT         (0)       /* Bits 0-15: Received byte count */
#define ETH_RSV_RXCNT_MASK          (0xffff << ETH_RSV_RXCNT_SHIFT)
#define ETH_RSV_PKTPI               (1 << 16) /* Bit 16: Packet previously ignored */
#define ETH_RSV_RXEPS               (1 << 17) /* Bit 17: RXDV event previously seen */
#define ETH_RSV_CEPS                (1 << 18) /* Bit 18: Carrier event previously seen */
#define ETH_RSV_RXCV                (1 << 19) /* Bit 19: Receive code violation */
#define ETH_RSV_CRCERR              (1 << 20) /* Bit 20: CRC error */
#define ETH_RSV_LENCHKERR           (1 << 21) /* Bit 21: Length check error */
#define ETH_RSV_LENOOR              (1 << 22) /* Bit 22: Length out of range */
#define ETH_RSV_RXOK                (1 << 23) /* Bit 23: Receive OK */
#define ETH_RSV_MCAST               (1 << 24) /* Bit 24: Multicast */
#define ETH_RSV_BCAST               (1 << 25) /* Bit 25: Broadcast */
#define ETH_RSV_DRIBNIB             (1 << 26) /* Bit 26: Dribble Nibble */
#define ETH_RSV_CTLFRAME            (1 << 27) /* Bit 27: Control frame */
#define ETH_RSV_PAUSE               (1 << 28) /* Bit 28: Pause */
#define ETH_RSV_UNSUPOP             (1 << 29) /* Bit 29: Unsupported Opcode */
#define ETH_RSV_VLAN                (1 << 30) /* Bit 30: VLAN */
                                              /* Bit 31: Reserved */
/* Flow control counter register (FCCNTR) */

