PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc17xx/lpc17_ethernet.h
#define ETH_FCCNTR_MCOUNT_SHIFT     (0)       /* Bits 0-15: Mirror count */
#define ETH_FCCNTR_MCOUNT_MASK      (0xffff << ETH_FCCNTR_MCOUNT_SHIFT)
#define ETH_FCCNTR_PTMR_SHIFT       (16)      /* Bits 16-31: Pause timer */
#define ETH_FCCNTR_PTMR_MASK        (0xffff << ETH_FCCNTR_PTMR_SHIFT)

/* Flow control status register (FCSTAT) */

#define ETH_FCSTAT_MCOUNT_SHIFT     (0)       /* Bits 0-15: Current mirror count */
#define ETH_FCSTAT_MCOUNT_MASK      (0xffff << ETH_FCSTAT_MCOUNT_SHIFT)
                                              /* Bits 16-31: Reserved */
/* Rx filter registers */
/* Receive filter control register (RXFLCTRL) */

#define ETH_RXFLCTRL_UCASTEN        (1 << 0)  /* Bit 0:  Accept all unicast frames */
#define ETH_RXFLCTRL_BCASTEN        (1 << 1)  /* Bit 1:  Accept all broadcast frames */
#define ETH_RXFLCTRL_MCASTEN        (1 << 2)  /* Bit 2:  Accept all multicast frames */
#define ETH_RXFLCTRL_UCASTHASHEN    (1 << 3)  /* Bit 3:  Accept hashed unicast */
#define ETH_RXFLCTRL_MCASTHASHEN    (1 << 4)  /* Bit 4:  Accect hashed multicast */
#define ETH_RXFLCTRL_PERFEN         (1 << 5)  /* Bit 5:  Accept perfect dest match */
                                              /* Bits 6-11: Reserved */
#define ETH_RXFLCTRL_MPKTEN         (1 << 12) /* Bit 12: Magic pkt filter WoL int */
#define ETH_RXFLCTRL_RXFILEN        (1 << 13) /* Bit 13: Perfect match WoL interrupt */
                                              /* Bits 14-31: Reserved */
/* Receive filter WoL status register (RXFLWOLST) AND
 * Receive filter WoL clear register (RXFLWOLCLR)
 */

#define ETH_RXFLWOL_UCAST           (1 << 0)  /* Bit 0:  Unicast frame WoL */
#define ETH_RXFLWOL_BCAST           (1 << 1)  /* Bit 1:  Broadcast frame WoL */
#define ETH_RXFLWOL_MCAST           (1 << 2)  /* Bit 2:  Multicast frame WoL */
#define ETH_RXFLWOL_UCASTHASH       (1 << 3)  /* Bit 3:  Unicast hash filter WoL */
#define ETH_RXFLWOL_MCASTHASH       (1 << 4)  /* Bit 4:  Multiicast hash filter WoL */
#define ETH_RXFLWOL_PERF            (1 << 5)  /* Bit 5:  Perfect addr match WoL  */
                                              /* Bit 6:  Reserved */
#define ETH_RXFLWOL_RXFIL           (1 << 7)  /* Bit 7:  Receive filter WoL */
#define ETH_RXFLWOL_MPKT            (1 << 8)  /* Bit 8:  Magic pkt filter WoL */
                                              /* Bits 9-31: Reserved */
/* Hash filter table LSBs register (HASHFLL) AND Hash filter table MSBs register
* (HASHFLH) Are registers containing a 32-bit value with no bitfield.
 */

/* Module control registers */
/* Interrupt status register (INTST), Interrupt enable register (INTEN), Interrupt
 * clear register (INTCLR), and Interrupt set register (INTSET) common bit field
 * definition:
 */

#define ETH_INT_RXOVR               (1 << 0)  /* Bit 0:  RX overrun interrupt */
#define ETH_INT_RXERR               (1 << 1)  /* Bit 1:  RX error interrupt */
#define ETH_INT_RXFIN               (1 << 2)  /* Bit 2:  RX finished interrupt */
#define ETH_INT_RXDONE              (1 << 3)  /* Bit 3:  RX done interrupt */
#define ETH_INT_TXUNR               (1 << 4)  /* Bit 4:  TX underrun interrupt */
#define ETH_INT_TXERR               (1 << 5)  /* Bit 5:  TX error interrupt */
#define ETH_INT_TXFIN               (1 << 6)  /* Bit 6:  TX finished interrupt */
#define ETH_INT_TXDONE              (1 << 7)  /* Bit 7:  TX done interrupt */
                                              /* Bits 8-11: Reserved */
#define ETH_INT_SOFT                (1 << 12) /* Bit 12: Soft interrupt */
#define ETH_INT_WKUP                (1 << 13) /* Bit 13: Wakeup interrupt */
                                              /* Bits 14-31: Reserved */
/* Power-down register */
                                              /* Bits 0-30: Reserved */
#define ETH_PWRDOWN_MACAHB          (1 << 31) /* Power down MAC/AHB */

/* Descriptors Offsets **************************************************************/

/* Tx descriptor offsets */

#define LPC17_TXDESC_PACKET         0x00      /* Base address of the Tx data buffer */
#define LPC17_TXDESC_CONTROL        0x04      /* Control Information */
#define LPC17_TXDESC_SIZE           0x08      /* Size in bytes of one Tx descriptor */

/* Tx status offsets */

#define LPC17_TXSTAT_INFO           0x00      /* Transmit status return flags */
#define LPC17_TXSTAT_SIZE           0x04      /* Size in bytes of one Tx status */

/* Rx descriptor offsets */

#define LPC17_RXDESC_PACKET         0x00      /* Base address of the Rx data buffer */
#define LPC17_RXDESC_CONTROL        0x04      /* Control Information */
#define LPC17_RXDESC_SIZE           0x08      /* Size in bytes of one Rx descriptor */

/* Rx status offsets */

#define LPC17_RXSTAT_INFO           0x00      /* Receive status return flags */
#define LPC17_RXSTAT_HASHCRC        0x04      /* Dest and source hash CRC */
#define LPC17_RXSTAT_SIZE           0x08      /* Size in bytes of one Rx status */

/* Descriptor Bit Definitions *******************************************************/

/* Tx descriptor bit definitions */

#define TXDESC_CONTROL_SIZE_SHIFT   (0)       /* Bits 0-10: Size of data buffer */
#define TXDESC_CONTROL_SIZE_MASK    (0x7ff << RXDESC_CONTROL_SIZE_SHIFT)

#define TXDESC_CONTROL_OVERRIDE     (1 << 26  /* Bit 26: Per-frame override */
#define TXDESC_CONTROL_HUGE         (1 << 27) /* Bit 27: Enable huge frame size */
#define TXDESC_CONTROL_PAD          (1 << 28) /* Bit 28: Pad short frames */
#define TXDESC_CONTROL_CRC          (1 << 29) /* Bit 29: Append CRC */
#define TXDESC_CONTROL_LAST         (1 << 30) /* Bit 30: Last descriptor of a fragment */
#define TXDESC_CONTROL_INT          (1 << 31) /* Bit 31: Generate TxDone interrupt */

/* Tx statis bit definitions */

#define TXSTAT_INFO_COLCNT_SHIFT    (21)      /* Bits 21-24: Number of collisions */
#define TXSTAT_INFO_COLCNT_MASK     (15 << TXSTAT_INFO_COLCNT_SHIFT)
#define TXSTAT_INFO_DEFER           (1 << 25) /* Bit 25: Packet deffered */
#define TXSTAT_INFO_EXCESSDEFER     (1 << 26) /* Bit 26: Excessive packet defferals */
#define TXSTAT_INFO_EXCESSCOL       (1 << 27) /* Bit 27: Excessive packet collisions */
#define TXSTAT_INFO_LATECOL         (1 << 28) /* Bit 28: Out of window collision */
#define TXSTAT_INFO_UNDERRUN        (1 << 29) /* Bit 29: Tx underrun */
#define TXSTAT_INFO_NODESC          (1 << 30) /* Bit 29: No Tx descriptor available */
#define TXSTAT_INFO_ERROR           (1 << 31) /* Bit 31: OR of other error conditions */

/* Rx descriptor bit definitions */

#define RXDESC_CONTROL_SIZE_SHIFT   (0)       /* Bits 0-10: Size of data buffer */
#define RXDESC_CONTROL_SIZE_MASK    (0x7ff << RXDESC_CONTROL_SIZE_SHIFT)
#define RXDESC_CONTROL_INT          (1 << 31) /* Bit 31: Generate RxDone interrupt */

/* Rx status bit definitions */

#define RXSTAT_SAHASHCRC_SHIFT      (0)       /* Bits 0-8: Hash CRC calculated from the source address */
#define RXSTAT_SAHASHCRC_MASK       (0x1ff << RXSTAT_SAHASHCRC_SHIFT)
#define RXSTAT_DAHASHCRC_SHIFT      (16)      /* Bits 16-24: Hash CRC calculated from the dest address */
#define RXSTAT_DAHASHCRC_MASK       (0x1ff << RXSTAT_DAHASHCRC_SHIFT)

